notes/iee859---teoria-do-valor-e-precos.org
:PROPERTIES:
:ID:       669465fc-f4fb-4569-ae8c-6ff779c6b05c
:END:
#+title: IEE859 - Teoria do valor e preços (Prof. Franklin Serrano)
#+subtitle: Distribuição e Preços Relativos na Abordagem do Excedente
#+DATE: 2º Semestre de 2021
#+LANGUAGE: pt_br
#+OPTIONS: num:nil ^:{} toc:nil
#+SETUPFILE: ../themes/comfy_inline/comfy_inline.theme
#+INCLUDE: ../header.org
#+filetags: :UFRJ:Notas_de_Aula:Demanda_Efetiva:Modelos_de_crescimento_liderados_pela_demanda:Moderna_Abordagem_do_Excedente:SraffianTheory:ModenSurplusApproach:EffectiveDemand:LecturesNotes:
#+PROPERTY:header-args python :results output html :eval never-export :session sraffa :exports both



* Introdução ao curso <2021-09-30 qui>


 [[https://1drv.ms/u/s!AhhdMDsRteCzwEIDFAlWFdb145HV?e=OYUs4m][Pasta curso valor e preços - UFRJ]]

** Retomada da abordagem do excedente


O projeto de pesquisa proposto a partir da retomada da abordagem clássica do excedente proposta por Sraffa e Garegnani trata das relações entre distribuição e preços relativos.

- Para Marx e Sraffa, a definição de "Economia Política Clássica" é uma forma de análise que utiliza a noção de *excedente*.
  - Marx descreve isso em "Teoria da Mais-Valia", escrito antes, mas publicado postumamente
    - O trabalho é a fonte do valor de troca e não do valor de uso
  - Sraffa denominou de "Teoria objetiva do valor"
- O projeto de pesquisa de Sraffa parte da HPE ao mesmo tempo que torna a HPE mais clara


** Complementariedade dos fatores de produção

- Não é razoável supor que existe produtividade marginal. O produto só será produzido quando ambos os fatores serem utilizados
  - Como consequência, o conflito distributivo e determinação do poder de barganha e da estrutura salarial são relevantes
    - _Exemplo:_ Em um trabalho acadêmico dificilmente é possível atribuir quem contribuiu com o que (execução/ideia)
  - *Problema da redução:* Dificuldade de reduzir a uma medida de trabalho homogênea via coeficientes técnicos na teoria da distribuição
    - Seria um equivalente a uma "teoria do capital humana heterodoxa"
    - Maior qualificação da mão-de-obra não é suficiente para gerar os postos de trabalho, mas sim a Demanda Efetiva
      - Permitiria ter prioridade na contratação salarial, mas não ter mais emprego

** Preços e custos de produção

- Tanto na teoria clássica quanto na teoria neoclássica, os preços são iguais aos custos de produção
  - Uma das diferenças é que na teoria neoclássica, os preços refletem escassez dos fatores
  - Isso não é o mesmo que uma reapresentação da contabilidade nacional
  - Outra difrença é importante é em relação à teoria da *distribuição*
  - _Exemplo da metáfora do diamante e da água:_
    - Clássicos: Diamante é mais caro porque os custos de produção são maiores para extraí-lo do que água apesar de ser menos útil
      - Condições técnicas de produção e da distribuição determinam a forma como o excedente é distribuído
      - Quantidades produzidas tem que pagar estes preços de produção.
        Não é relevante os motivos/utilidade para gerar essa demanda
      - Adequa-se a produção à quem tem dinheiro para pagar.
        - Exemplo: Todos podem ter uma demanda (potencial) por bens de luxo, mas somente poucos podem pagar por este bem a preços que tornam essa produção rentável.
    - Neoclássicos: Nada impõe que o diamante não é útil. Além disso, a dotação relativo dos fatores é diferente.
      - Existe um leilão de uma quantidade fixa
  - Em resumo, a teoria dos preços relativos dependem necessariamente da teoria da *distribuição*

* Sraffa antes de 1960 <2021-09-30 qui> e <2021-10-07 qui>
:PROPERTIES:
:ID:       9610fd16-ec5c-472c-9cb0-9c6222156e32
:END:

** Referências

- Piero Sraffa, 1926 “The laws of returns under competitive conditions”, Economic Journal, Economic Journal, December , 1926
- Piero Sraffa, 1931 “D2/4 Lecture Notes on the Advanced Theory of Value, 1928-31”, Trinity College, Cambridge
- Saverio Fratini, 2016 “Sraffa on the Degeneration of the Notion of Cost” Centro Sraffa Working Papers, n. 21, August 2016
- Pierangelo Garegnani, 2005 "On a turning point in Sraffa's theoretical and interpretative position in the late 1920s ," European Journal of the History of Economic Thought, , vol. 12(3), pages 453-492, September.

** Equilíbrio geral e parcial

- Em um modelo de equilíbrio geral, a demanda de um bem depende da demanda dos outros bens também
  - Dominância diagonal :: A demanda de um bem depender principalmente do próprio preço
    - Achava-se que era suficiente supor dominância diagonal para poder existir um equilíbrio *parcial*
    - Atualmente, chama-se de axioma fraco das preferências reveladas (ou algo próximo disso)
    - Supõe-se que não há problemas no equilíbrio geral
  - No entanto, o aumento do preço relativo de um bem não implica necessariamente que o a demanda de outro bem irá aumentar.
    Isso porque é possível que possa afetar o custo de outro bem.
    - Em um modelo de equilíbrio parcial, na teoria neoclássica, há efeito substituição e renda.
      No entanto, em um modelo de equilíbrio *geral* (em que todos os que consomem necessariamente produzem algo), a renda de um agente também depende do que este agente produz.
      - Em equilíbrio geral, o efeito renda pode ter qualquer efeito

