docs/notes/iee859---teoria-do-valor-e-precos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_br" xml:lang="pt_br">
<head>
<!-- 2021-10-28 qui 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IEE859 - Teoria do valor e preços (Prof. Franklin Serrano)</title>
<meta name="author" content="Gabriel Petrini" />
<meta name="description" content="Header" />
<meta name="generator" content="Org Mode" />
<style> li{max-width:800px;}</style
</head>
<body>
<div id="content" class="content">
<h1 class="title">IEE859 - Teoria do valor e preços (Prof. Franklin Serrano)
<br />
<span class="subtitle">Distribuição e Preços Relativos na Abordagem do Excedente</span>
</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="../index.html">HOME</a></td>
<td class="org-left"><a href="../HouseKeeping/index.html">Housekeeping</a></td>
<td class="org-left"><a href="../gtd/inbox.html">Inbox</a></td>
<td class="org-left"><a href="../gtd/projects.html">Projects</a></td>
<td class="org-left"><a href="index.html">Bibliographic notes</a></td>
<td class="org-left"><a href="../gtd/readings.html">Reading list</a></td>
<td class="org-left"><a href="../Lectures/index.html">Lectures</a></td>
<td class="org-left"><a href="../Teaching/index.html">Teaching</a></td>
<td class="org-left"><a href="../KnowledgeBase/index.html">Knowledge Base</a></td>
<td class="org-left"><a href="../OffOffice/index.html">Off Office</a></td>
</tr>
</tbody>
</table>



<div id="outline-container-org942961b" class="outline-2">
<h2 id="org942961b">Introdução ao curso <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-30 qui&gt;</span></span></h2>
<div class="outline-text-2" id="text-org942961b">
<p>
<a href="https://1drv.ms/u/s!AhhdMDsRteCzwEIDFAlWFdb145HV?e=OYUs4m">Pasta curso valor e preços - UFRJ</a>
</p>
</div>

<div id="outline-container-org6019ccc" class="outline-3">
<h3 id="org6019ccc">Retomada da abordagem do excedente</h3>
<div class="outline-text-3" id="text-org6019ccc">
<p>
O projeto de pesquisa proposto a partir da retomada da abordagem clássica do excedente proposta por Sraffa e Garegnani trata das relações entre distribuição e preços relativos.
</p>

<ul class="org-ul">
<li>Para Marx e Sraffa, a definição de "Economia Política Clássica" é uma forma de análise que utiliza a noção de <b>excedente</b>.
<ul class="org-ul">
<li>Marx descreve isso em "Teoria da Mais-Valia", escrito antes, mas publicado postumamente
<ul class="org-ul">
<li>O trabalho é a fonte do valor de troca e não do valor de uso</li>
</ul></li>
<li>Sraffa denominou de "Teoria objetiva do valor"</li>
</ul></li>
<li>O projeto de pesquisa de Sraffa parte da HPE ao mesmo tempo que torna a HPE mais clara</li>
</ul>
</div>
</div>


<div id="outline-container-org2c5c0ff" class="outline-3">
<h3 id="org2c5c0ff">Complementariedade dos fatores de produção</h3>
<div class="outline-text-3" id="text-org2c5c0ff">
<ul class="org-ul">
<li>Não é razoável supor que existe produtividade marginal. O produto só será produzido quando ambos os fatores serem utilizados
<ul class="org-ul">
<li>Como consequência, o conflito distributivo e determinação do poder de barganha e da estrutura salarial são relevantes
<ul class="org-ul">
<li><span class="underline">Exemplo:</span> Em um trabalho acadêmico dificilmente é possível atribuir quem contribuiu com o que (execução/ideia)</li>
</ul></li>
<li><b>Problema da redução:</b> Dificuldade de reduzir a uma medida de trabalho homogênea via coeficientes técnicos na teoria da distribuição
<ul class="org-ul">
<li>Seria um equivalente a uma "teoria do capital humana heterodoxa"</li>
<li>Maior qualificação da mão-de-obra não é suficiente para gerar os postos de trabalho, mas sim a Demanda Efetiva
<ul class="org-ul">
<li>Permitiria ter prioridade na contratação salarial, mas não ter mais emprego</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org22e775e" class="outline-3">
<h3 id="org22e775e">Preços e custos de produção</h3>
<div class="outline-text-3" id="text-org22e775e">
<ul class="org-ul">
<li>Tanto na teoria clássica quanto na teoria neoclássica, os preços são iguais aos custos de produção
<ul class="org-ul">
<li>Uma das diferenças é que na teoria neoclássica, os preços refletem escassez dos fatores</li>
<li>Isso não é o mesmo que uma reapresentação da contabilidade nacional</li>
<li>Outra difrença é importante é em relação à teoria da <b>distribuição</b></li>
<li><span class="underline">Exemplo da metáfora do diamante e da água:</span>
<ul class="org-ul">
<li>Clássicos: Diamante é mais caro porque os custos de produção são maiores para extraí-lo do que água apesar de ser menos útil
<ul class="org-ul">
<li>Condições técnicas de produção e da distribuição determinam a forma como o excedente é distribuído</li>
<li>Quantidades produzidas tem que pagar estes preços de produção.
Não é relevante os motivos/utilidade para gerar essa demanda</li>
<li>Adequa-se a produção à quem tem dinheiro para pagar.
<ul class="org-ul">
<li>Exemplo: Todos podem ter uma demanda (potencial) por bens de luxo, mas somente poucos podem pagar por este bem a preços que tornam essa produção rentável.</li>
</ul></li>
</ul></li>
<li>Neoclássicos: Nada impõe que o diamante não é útil. Além disso, a dotação relativo dos fatores é diferente.
<ul class="org-ul">
<li>Existe um leilão de uma quantidade fixa</li>
</ul></li>
</ul></li>
<li>Em resumo, a teoria dos preços relativos dependem necessariamente da teoria da <b>distribuição</b></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5eb3790" class="outline-2">
<h2 id="org5eb3790">Sraffa antes de 1960 <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-09-30 qui&gt; </span></span> e <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-10-07 qui&gt;</span></span></h2>
<div class="outline-text-2" id="text-org5eb3790">
</div>

<div id="outline-container-orga3acb36" class="outline-3">
<h3 id="orga3acb36">Referências</h3>
<div class="outline-text-3" id="text-orga3acb36">
<ul class="org-ul">
<li>Piero Sraffa, 1926 “The laws of returns under competitive conditions”, Economic Journal, Economic Journal, December , 1926</li>
<li>Piero Sraffa, 1931 “D2/4 Lecture Notes on the Advanced Theory of Value, 1928-31”, Trinity College, Cambridge</li>
<li>Saverio Fratini, 2016 “Sraffa on the Degeneration of the Notion of Cost” Centro Sraffa Working Papers, n. 21, August 2016</li>
<li>Pierangelo Garegnani, 2005 "On a turning point in Sraffa's theoretical and interpretative position in the late 1920s ," European Journal of the History of Economic Thought, , vol. 12(3), pages 453-492, September.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcbf275b" class="outline-3">
<h3 id="orgcbf275b">Equilíbrio geral e parcial</h3>
<div class="outline-text-3" id="text-orgcbf275b">
<ul class="org-ul">
<li>Em um modelo de equilíbrio geral, a demanda de um bem depende da demanda dos outros bens também
<dl class="org-dl">
<dt>Dominância diagonal</dt><dd>A demanda de um bem depender principalmente do próprio preço
<ul class="org-ul">
<li>Achava-se que era suficiente supor dominância diagonal para poder existir um equilíbrio <b>parcial</b></li>
<li>Atualmente, chama-se de axioma fraco das preferências reveladas (ou algo próximo disso)</li>
<li>Supõe-se que não há problemas no equilíbrio geral</li>
</ul></dd>
<dt>(no term)</dt><dd>No entanto, o aumento do preço relativo de um bem não implica necessariamente que o a demanda de outro bem irá aumentar.
Isso porque é possível que possa afetar o custo de outro bem.
<ul class="org-ul">
<li>Em um modelo de equilíbrio parcial, na teoria neoclássica, há efeito substituição e renda.
No entanto, em um modelo de equilíbrio <b>geral</b> (em que todos os que consomem necessariamente produzem algo), a renda de um agente também depende do que este agente produz.
<ul class="org-ul">
<li>Em equilíbrio geral, o efeito renda pode ter qualquer efeito</li>
</ul></li>
</ul></dd>
</dl></li>
</ul>
</div>
</div>
