notes/iee859---teoria-do-valor-e-precos.org
** Curva de oferta de longo prazo de concorrência perfeita

Em equilíbrio parcial, Sraffa concluiu que a curva de oferta de longo prazo (em concorrência perfeita) é horizontal e não *positivamente* inclinada.
- O custo é crescente dado um aumento da demanda uma vez que o estoque de capital (no curto prazo) é dado
  - Retorno decrescente
- No longo prazo, o estoque de capital não é mais constante.
  Portanto, os custos são constantes (para um setor individual).
- Para ter como resultado inequívoco que o aumento dos custos de fatores de setor só vai afetá-lo se supor que estes fatores são específicos
- Se houver retornos crescentes (e, por consequência custos decrescentes), haverá monopólio no longo prazo
  - A forma que Marshall superou essa questão é supor que *ao nível da firma* não há retornos de escala
    - Os retornos crescentes são *externos* (externalidades) à firma.
      Quando as empresas, de modo geral, aumentam a produção (por conta da indivisibilidade), haverá retornos crescentes.
      - _Exemplo:_ Quanto mais firmas utilizam um trem, maior será a economia
    - Sraffa afirma que essa alternativa é mais limitada
      - Pode existir economias de escala externas às empresas e ao *setor*
      - _Exemplo:_ Se outros setores usarem o mesmo trem, poderiam ser beneficiadas. Para a solução de Marshall ser válida, precisaria ser externa à firma e *interna* ao setor.
- A curva de longo prazo ser horizontal não implica preços deixarem de refletir escassez relativa
  - O motivo do porque isso ocorre na teoria neoclássica é que a dotação *total* (de equilíbrio geral) é limitada
  - A curva de longo prazo geral da economia é *positivamente* inclinada
- Se, em equilíbrio parcial, a curva de oferta é horizontal no longo prazo, a demanda determina a produção e a oferta determina os custos.
- Para conciliar custos decrescentes para a empresa sem incorrer em monopólio, Sraffa (1926) propõe *concorrência imperfeita* para reabilitar a teoria de equilíbrio parcial

** Equilíbrio parcial e predominância da teoria Marshalliana

- Houve uma certa noção de que o instrumental proposto por Marshall era uma forma neutra de se avaliar mercados isolados
- Sraffa passou a ser mais relevante porque era uma forma de tornar a saída de Marshall mais realista
- Posteriormente, Sraffa (1930) propõe que a teoria Marshalliana deveria ser abandonada
  - Concorrência imperfeita é insuficiente para incluir realismo a essa teoria

** Curva de demanda negativamente inclinada e a curva de demanda quebrada

- A demanda de um bem depende da reação dos concorrentes.
  Se não reagirem a uma redução do preço, será elástica; se reagirem será inelástica em relação à quantidade.
- Uma forma de resolver esse problema poderia ser via teoria dos jogos, mas não consegui-se
  - Isso seria para encontrar em que momento a curva de demanda seria quebrada
- O problema, portanto, não é a curva de demanda de mercado, mas sim a curva de demanda da *firma*
  - A demanda de cada firma depende da reação de cada um dos concorrentes
  - Alguns autores propuseram que poderia existir um cartel colusivo
  - Noção de concorrência neoclássica enquanto dependente do *número de firmas*
    - Não é razoável, no entanto, supor que o número de firmas é fixo
  - Existe um elemento de *indeterminação* na teoria de _organização industrial_ em que a curva de demanda da firma é subjetiva


** Preço limite e renda diferencial
:PROPERTIES:
:ID:       95c70823-73fa-4bcd-90bd-ba0d49d8b0c5
:END:


- A renda (lucro) de determinado agente é dado pelo entrante potencial
- O lucro extra-normal se dá não porque o preço deste produto é elevado, mas sim pelo custos (diferenciais) do produtor inframarginal é mais elevado
- Aumentar os preços induziria aumentar a entrada de concorrentes; mas uma vez definido o preço pelo produtor inframarginal, os lucros do produtor com a técnica dominante será maior
  - Mobilidade de capitais pode significar tanto mais firmas entrarem em determinado setor quanto capacidade de replicar a técnica superior.
  - _Exemplo:_ Demandante de um produto é indiferente se foi produzido com custos maiores ou não, mas toma a decisão em função do preço
    - O preço é alto porque os custos dos rivais é mais elevado e não os custos são elevados porque o preço é mais alto
    - Exemplo de Ricardo sobre renda da terra e preços
    - O que é relevante para determinar a margem de lucro são os custos e não os preços
- Alguns autores, sobretudo Kaleckianos, atribuem que a teoria do valor deixa de ser válida na medida que o capitalisto tornou-se mais desenvolvido (monopolista)

** Rumo a uma teoria objetiva dos preços relativos e custos de produção

- Sraffa percebeu que poderia apresentar os custos de produção a partir de uma medida física, sem precisar utilizar alguma forma subjetiva.
- Parte dessa mudança é a percepção de que o custo pode ser material (matéria-prima, bens salários) e não subjetivo (relacionado a sacrifício)


** Implicações desta discussão para as teorias de crescimento liderados pela demanda

- Não motivos para que --- dada a técnica produtiva relevante --- os retornos da produção não sejam constantes
  - Retornos decrescentes de escala ocorreriam na presença de "regresso técnico" ou que a está sendo usada uma técnica produtiva pouco usual (má especificação dos insumos)
  - Já retornos crescentes são bastante comuns uma vez que
    - Existe indivisibilidade
- Retomada aos clássicos:
  - Definição dos prazos teóricos:
    - Curto prazo é aquele que em que o preço que prevalesce é o de mercado
    - Longo prazo é aquele em que prevalesce o preço normal que refletem os custos de produção
      - Isso também ocorre na teoria neoclássica. Portanto, a diferença se dá principalmente no mercado de fatores e seus custos.
        - No entanto, Sraffa conclui que não existe equilíbrio parcial dos fatores e, portanto, seria necessário lançar mão de um modelo de equilíbrio parcial.
        - Para compreender os determinantes dos custos, é preciso compreender como se dá a distribuição do excedente.
  - Não há como especificar um preço de equilíbrio uma vez que não é possível especificar curvas de oferta e demanda
    - Exemplo de mercados perecíveis e possibilidade de armazenamento
    - Pode existir bolhas
      - Bolhas a partir de bens produzidos (que possuem custos de produção) tendem a estourar uma vez que haverá um excesso de produção


** Resumo

