docs/notes/iee859---teoria-do-valor-e-precos.html

<div id="outline-container-orgfd2739d" class="outline-3">
<h3 id="orgfd2739d">Curva de oferta de longo prazo de concorrência perfeita</h3>
<div class="outline-text-3" id="text-orgfd2739d">
<p>
Em equilíbrio parcial, Sraffa concluiu que a curva de oferta de longo prazo (em concorrência perfeita) é horizontal e não <b>positivamente</b> inclinada.
</p>
<ul class="org-ul">
<li>O custo é crescente dado um aumento da demanda uma vez que o estoque de capital (no curto prazo) é dado
<ul class="org-ul">
<li>Retorno decrescente</li>
</ul></li>
<li>No longo prazo, o estoque de capital não é mais constante.
Portanto, os custos são constantes (para um setor individual).</li>
<li>Para ter como resultado inequívoco que o aumento dos custos de fatores de setor só vai afetá-lo se supor que estes fatores são específicos</li>
<li>Se houver retornos crescentes (e, por consequência custos decrescentes), haverá monopólio no longo prazo
<ul class="org-ul">
<li>A forma que Marshall superou essa questão é supor que <b>ao nível da firma</b> não há retornos de escala
<ul class="org-ul">
<li>Os retornos crescentes são <b>externos</b> (externalidades) à firma.
Quando as empresas, de modo geral, aumentam a produção (por conta da indivisibilidade), haverá retornos crescentes.
<ul class="org-ul">
<li><span class="underline">Exemplo:</span> Quanto mais firmas utilizam um trem, maior será a economia</li>
</ul></li>
<li>Sraffa afirma que essa alternativa é mais limitada
<ul class="org-ul">
<li>Pode existir economias de escala externas às empresas e ao <b>setor</b></li>
<li><span class="underline">Exemplo:</span> Se outros setores usarem o mesmo trem, poderiam ser beneficiadas. Para a solução de Marshall ser válida, precisaria ser externa à firma e <b>interna</b> ao setor.</li>
</ul></li>
</ul></li>
</ul></li>
<li>A curva de longo prazo ser horizontal não implica preços deixarem de refletir escassez relativa
<ul class="org-ul">
<li>O motivo do porque isso ocorre na teoria neoclássica é que a dotação <b>total</b> (de equilíbrio geral) é limitada</li>
<li>A curva de longo prazo geral da economia é <b>positivamente</b> inclinada</li>
</ul></li>
<li>Se, em equilíbrio parcial, a curva de oferta é horizontal no longo prazo, a demanda determina a produção e a oferta determina os custos.</li>
<li>Para conciliar custos decrescentes para a empresa sem incorrer em monopólio, Sraffa (1926) propõe <b>concorrência imperfeita</b> para reabilitar a teoria de equilíbrio parcial</li>
</ul>
</div>
</div>

<div id="outline-container-org228b10e" class="outline-3">
<h3 id="org228b10e">Equilíbrio parcial e predominância da teoria Marshalliana</h3>
<div class="outline-text-3" id="text-org228b10e">
<ul class="org-ul">
<li>Houve uma certa noção de que o instrumental proposto por Marshall era uma forma neutra de se avaliar mercados isolados</li>
<li>Sraffa passou a ser mais relevante porque era uma forma de tornar a saída de Marshall mais realista</li>
<li>Posteriormente, Sraffa (1930) propõe que a teoria Marshalliana deveria ser abandonada
<ul class="org-ul">
<li>Concorrência imperfeita é insuficiente para incluir realismo a essa teoria</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9a9af6a" class="outline-3">
<h3 id="org9a9af6a">Curva de demanda negativamente inclinada e a curva de demanda quebrada</h3>
<div class="outline-text-3" id="text-org9a9af6a">
<ul class="org-ul">
<li>A demanda de um bem depende da reação dos concorrentes.
Se não reagirem a uma redução do preço, será elástica; se reagirem será inelástica em relação à quantidade.</li>
<li>Uma forma de resolver esse problema poderia ser via teoria dos jogos, mas não consegui-se
<ul class="org-ul">
<li>Isso seria para encontrar em que momento a curva de demanda seria quebrada</li>
</ul></li>
<li>O problema, portanto, não é a curva de demanda de mercado, mas sim a curva de demanda da <b>firma</b>
<ul class="org-ul">
<li>A demanda de cada firma depende da reação de cada um dos concorrentes</li>
<li>Alguns autores propuseram que poderia existir um cartel colusivo</li>
<li>Noção de concorrência neoclássica enquanto dependente do <b>número de firmas</b>
<ul class="org-ul">
<li>Não é razoável, no entanto, supor que o número de firmas é fixo</li>
</ul></li>
<li>Existe um elemento de <b>indeterminação</b> na teoria de <span class="underline">organização industrial</span> em que a curva de demanda da firma é subjetiva</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org8a16ae9" class="outline-3">
<h3 id="org8a16ae9">Preço limite e renda diferencial</h3>
<div class="outline-text-3" id="text-org8a16ae9">
<ul class="org-ul">
<li>A renda (lucro) de determinado agente é dado pelo entrante potencial</li>
<li>O lucro extra-normal se dá não porque o preço deste produto é elevado, mas sim pelo custos (diferenciais) do produtor inframarginal é mais elevado</li>
<li>Aumentar os preços induziria aumentar a entrada de concorrentes; mas uma vez definido o preço pelo produtor inframarginal, os lucros do produtor com a técnica dominante será maior
<ul class="org-ul">
<li>Mobilidade de capitais pode significar tanto mais firmas entrarem em determinado setor quanto capacidade de replicar a técnica superior.</li>
<li><span class="underline">Exemplo:</span> Demandante de um produto é indiferente se foi produzido com custos maiores ou não, mas toma a decisão em função do preço
<ul class="org-ul">
<li>O preço é alto porque os custos dos rivais é mais elevado e não os custos são elevados porque o preço é mais alto</li>
<li>Exemplo de Ricardo sobre renda da terra e preços</li>
<li>O que é relevante para determinar a margem de lucro são os custos e não os preços</li>
</ul></li>
</ul></li>
<li>Alguns autores, sobretudo Kaleckianos, atribuem que a teoria do valor deixa de ser válida na medida que o capitalisto tornou-se mais desenvolvido (monopolista)</li>
</ul>
</div>
</div>

<div id="outline-container-org83fdf1b" class="outline-3">
<h3 id="org83fdf1b">Rumo a uma teoria objetiva dos preços relativos e custos de produção</h3>
<div class="outline-text-3" id="text-org83fdf1b">
<ul class="org-ul">
<li>Sraffa percebeu que poderia apresentar os custos de produção a partir de uma medida física, sem precisar utilizar alguma forma subjetiva.</li>
<li>Parte dessa mudança é a percepção de que o custo pode ser material (matéria-prima, bens salários) e não subjetivo (relacionado a sacrifício)</li>
</ul>
</div>
</div>


<div id="outline-container-orgc7d9c05" class="outline-3">
<h3 id="orgc7d9c05">Implicações desta discussão para as teorias de crescimento liderados pela demanda</h3>
<div class="outline-text-3" id="text-orgc7d9c05">
<ul class="org-ul">
<li>Não motivos para que &#x2014; dada a técnica produtiva relevante &#x2014; os retornos da produção não sejam constantes
<ul class="org-ul">
<li>Retornos decrescentes de escala ocorreriam na presença de "regresso técnico" ou que a está sendo usada uma técnica produtiva pouco usual (má especificação dos insumos)</li>
<li>Já retornos crescentes são bastante comuns uma vez que
<ul class="org-ul">
<li>Existe indivisibilidade</li>
</ul></li>
</ul></li>
<li>Retomada aos clássicos:
<ul class="org-ul">
<li>Definição dos prazos teóricos:
<ul class="org-ul">
<li>Curto prazo é aquele que em que o preço que prevalesce é o de mercado</li>
<li>Longo prazo é aquele em que prevalesce o preço normal que refletem os custos de produção
<ul class="org-ul">
<li>Isso também ocorre na teoria neoclássica. Portanto, a diferença se dá principalmente no mercado de fatores e seus custos.
<ul class="org-ul">
<li>No entanto, Sraffa conclui que não existe equilíbrio parcial dos fatores e, portanto, seria necessário lançar mão de um modelo de equilíbrio parcial.</li>
<li>Para compreender os determinantes dos custos, é preciso compreender como se dá a distribuição do excedente.</li>
</ul></li>
</ul></li>
</ul></li>
<li>Não há como especificar um preço de equilíbrio uma vez que não é possível especificar curvas de oferta e demanda
<ul class="org-ul">
<li>Exemplo de mercados perecíveis e possibilidade de armazenamento</li>
<li>Pode existir bolhas
<ul class="org-ul">
<li>Bolhas a partir de bens produzidos (que possuem custos de produção) tendem a estourar uma vez que haverá um excesso de produção</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
