notes/iee859---teoria-do-valor-e-precos.org
*** Críticas a teoria marshaliana do equilíbrio parcial

- Curva de oferta de longo prazo de concorrência perfeita em equilíbrio parcial é horizontal
- Custos crescentes:
  - Incompatível com equilíbrio parcial e com equilíbrio de longo prazo
  - Preço do fator: Incompatível com equilíbrio papcial
  - Coeficientes técnicos: Incompatível com equilíbrio de longo prazo
- Custos decrescentes:
  - Economias internas à firma, mas externas ao setor: incompatível com concorrência perfeita
  - Economias externa ao mercado: incompatível com equilíbrio parical
- Concorrência imperfeita: problema da curva de demanda da firma negativamente inclinada
  - Forma de conciliar os problemas anteriores com a teoria neoclássica
  - No limite, a teoria neoclássica requeria uma curva de custos constantes.
    Um dos motivos pelo qual Sraffa abandona a teoria marshaliana é tanto a subjetividade dos custos quanto a imposição de determinado comportamento dos custos (constantes).
    - Portanto, neste momento Sraffa rompe com a teoria neoclássica da oferta. Adiante romperá com a demanda.

*** As "primeiras equações" e mudança de interpretação da teoria do valor

**** Dois tipos de teoria do valor
- Ideia de dois tipos de teoria do valor: Trabalho ou utilidade
- Explicação dos preços relativos das mercadorias: equilíbrio parcial, custo de produção e retornos constantes

**** TODO Mudanças ao final de 1927 e as primeiras equações (VER Slides)

- As primeiras equações e o caminho para a produção

*** Degeneração da noção de custo (VER Slides)

- Fisiocratas:
- Valor se torna simétrico: iguala a utilidade (demanda) ao sacrifício (custo)
  - Em função desse caráter subjetivo, rejeita também o equilíbrio geral

**** Importância do princípio da substituição

*** Críticas externas à teoria marginalista em geral (Ver slide)

- Curva de oferta de fatores
  - Desutilidade marginal do trabalho
  - Parcimônia
- Curva de demanda por fatores
  - Depende de suposições sobre as técnicas


* Produção de mercadorias por meio de mercadorias: determinação da taxa de lucro e preços relativos em sistemas de capital circulante <2021-10-07 qui> e <2021-10-14 qui>
:PROPERTIES:
:ID:       8149d38f-b940-4d80-9a13-ebf1cc7fc2cb
:END:

** Sraffa e o livro

*Projeto:* Crítica a abordagem marginalista


** Um livro, dois gráficos


1. Relação inversa entre salário real e taxa de lucro
2. Relação complexa entre preços relativos e taxa de lucro
   1. Na teoria neoclássica, como os preços relativos também dependiam da taxa de lucro, isso gerava inconsistências internas
   2. Dificuldades de mensurar o excedente físico e, assim, calcular a taxa de lucro

** "Autosuficiência" e viabilidade

*** Produção de trigo por meio de trigo


- Economia muito simples que produz um único bem ($X_{1}$) o utiliza como insumo (capital circulante) ($A_{11}$)
  - Capital circulante não é sinônimo de consumo intermediário
    - A diferença é que o capital circulante pode ser usado uma única vez enquanto o capital fixo pode ser reutilizado
- É preciso que exista uma relação técnica ($a_{11}$) tecnicamente viável ($a_{11}<1$). No entanto, esta condição não é suficiente uma vez que é preciso remunerar o trabalho ($b_{1}\cdot l$). Portanto, há uma *condição social*: $a_{11}  + b_{1}\cdot l$
- Excedente mede o produto líquido da economia
  - Preços em Sraffa não garantem reposição uma vez quando se considera investimento líquido
  - Os preços que Sraffa descreve reflete os coeficientes técnicos
  - É o resíduo dos custos aproximados de repor a produção

#+BEGIN_latex
\begin{equation}
A_{11}, L_{1} \to X_{1}
\end{equation}
#+END_latex
#+BEGIN_latex
\begin{equation}
a_{11}, l_{1} \to 1
\end{equation}
#+END_latex

Produzirá excedente se

#+BEGIN_latex
\begin{equation}
a_{11} + b_{1}\cdot l_{1} < 1
\end{equation}
#+END_latex
neste caso, será um excedente em trigo ou em trabalho.

Por outro lado, será uma economia de subsistência se
#+BEGIN_latex
\begin{equation}
a_{11} + b_{1}\cdot l_{1} = 1
\end{equation}
#+END_latex


A forma de mensuração do excedente não é o mais relevante, mas sim a representação do sistema econômico.
Dada uma técnica produtiva relevante e uma variável distributiva exógena, é possível indicar a existência do excedente.
O núcleo da teoria do excedente é indicar os elementos em comuns dos autores que partem da noção de excedente.


O excedente é uma condição necessária para:
- Divisão social do trabalho
- Acumulação de capital
  - Excedente permite existência de investimento líquido
  - Excedente é condição necessária, mas não suficiente
- Estratificação social
  - O que muda entre sistemas econômicos é a regra de divisão do excedente

*** Produção a partir de dois insumos e sem excedente

Sabendo os coeficientes técnicos (necessários), é possível obter os preços relativos sem precisar discutir formato de curvas de oferta e demanda.
Para uma economia de subsistência em que o coeficiente $a_{ij}$ já inclui salários (coeficiente aumentado):

#+BEGIN_latex
\begin{equation}
\begin{cases}
a_{11}\cdot p_{1} + a_{12}\cdot p_{2} = p_{1}\\
a_{21}\cdot p_{2} + a_{22}\cdot p_{2} = p_{2}
\end{cases}
\end{equation}
#+END_latex


Supondo que as relações técnicas são dadas, qual o preço relativo?
Por simplificação, é possível supor que um dos preços é unitário:

#+BEGIN_latex
\begin{equation}
p_{1} = 1
\end{equation}
#+END_latex
#+BEGIN_latex
\begin{equation}
\frac{p_{2}}{p_{1}} = \frac{a_{12}}{1-a_{22}} = \frac{a_{21}}{1-a_{11}}
\end{equation}
#+END_latex
A implicação é que um setor não é independente do outro.
Por exemplo, supondo que o setor 2 remunera os trabalhadores a um salário mais alto.
Para este setor, pode não haver problemas.
No entanto, para o outro setor os custos de obter o produto produzido pelo setor 2 serão maiores.
O preço relativo precisa ser igual ao necessário para garantir a reprodução do sistema.
Os preços relativos são tal que tudo que o setor 2 não utilizou para a sua própria produção tem que ser suficiente para que o outro setor compre.
Dessa forma, é uma teoria objetiva e material das relações de troca.
Um sistema sem excedente não possui grau de liberdade.


#+BEGIN_latex
\begin{equation}
\frac{p_{2}}{p_{1}} = \frac{\text{Bens setor precisa de outro}}{\text{Excedente fisico deste setor}}
\end{equation}
#+END_latex
Para dois bens, os preços relativos refletem a interdependência física entre os setores.
Para mais de dois bens, esta relação não é tão direta.

