docs/notes/iee859---teoria-do-valor-e-precos.html


<div id="outline-container-org09ea5a8" class="outline-3">
<h3 id="org09ea5a8">Resumo</h3>
<div class="outline-text-3" id="text-org09ea5a8">
</div>
<div id="outline-container-orgb85566d" class="outline-4">
<h4 id="orgb85566d">Críticas a teoria marshaliana do equilíbrio parcial</h4>
<div class="outline-text-4" id="text-orgb85566d">
<ul class="org-ul">
<li>Curva de oferta de longo prazo de concorrência perfeita em equilíbrio parcial é horizontal</li>
<li>Custos crescentes:
<ul class="org-ul">
<li>Incompatível com equilíbrio parcial e com equilíbrio de longo prazo</li>
<li>Preço do fator: Incompatível com equilíbrio papcial</li>
<li>Coeficientes técnicos: Incompatível com equilíbrio de longo prazo</li>
</ul></li>
<li>Custos decrescentes:
<ul class="org-ul">
<li>Economias internas à firma, mas externas ao setor: incompatível com concorrência perfeita</li>
<li>Economias externa ao mercado: incompatível com equilíbrio parical</li>
</ul></li>
<li>Concorrência imperfeita: problema da curva de demanda da firma negativamente inclinada
<ul class="org-ul">
<li>Forma de conciliar os problemas anteriores com a teoria neoclássica</li>
<li>No limite, a teoria neoclássica requeria uma curva de custos constantes.
Um dos motivos pelo qual Sraffa abandona a teoria marshaliana é tanto a subjetividade dos custos quanto a imposição de determinado comportamento dos custos (constantes).
<ul class="org-ul">
<li>Portanto, neste momento Sraffa rompe com a teoria neoclássica da oferta. Adiante romperá com a demanda.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org92194a6" class="outline-4">
<h4 id="org92194a6">As "primeiras equações" e mudança de interpretação da teoria do valor</h4>
<div class="outline-text-4" id="text-org92194a6">
</div>
<div id="outline-container-org858bc79" class="outline-5">
<h5 id="org858bc79">Dois tipos de teoria do valor</h5>
<div class="outline-text-5" id="text-org858bc79">
<ul class="org-ul">
<li>Ideia de dois tipos de teoria do valor: Trabalho ou utilidade</li>
<li>Explicação dos preços relativos das mercadorias: equilíbrio parcial, custo de produção e retornos constantes</li>
</ul>
</div>
</div>

<div id="outline-container-org8beff6c" class="outline-5">
<h5 id="org8beff6c"><span class="todo TODO">TODO</span> Mudanças ao final de 1927 e as primeiras equações (VER Slides)</h5>
<div class="outline-text-5" id="text-org8beff6c">
<ul class="org-ul">
<li>As primeiras equações e o caminho para a produção</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgee91193" class="outline-4">
<h4 id="orgee91193">Degeneração da noção de custo (VER Slides)</h4>
<div class="outline-text-4" id="text-orgee91193">
<ul class="org-ul">
<li>Fisiocratas:</li>
<li>Valor se torna simétrico: iguala a utilidade (demanda) ao sacrifício (custo)
<ul class="org-ul">
<li>Em função desse caráter subjetivo, rejeita também o equilíbrio geral</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgcffe327" class="outline-5">
<h5 id="orgcffe327">Importância do princípio da substituição</h5>
</div>
</div>

<div id="outline-container-orgb24d5f3" class="outline-4">
<h4 id="orgb24d5f3">Críticas externas à teoria marginalista em geral (Ver slide)</h4>
<div class="outline-text-4" id="text-orgb24d5f3">
<ul class="org-ul">
<li>Curva de oferta de fatores
<ul class="org-ul">
<li>Desutilidade marginal do trabalho</li>
<li>Parcimônia</li>
</ul></li>
<li>Curva de demanda por fatores
<ul class="org-ul">
<li>Depende de suposições sobre as técnicas</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org853d999" class="outline-2">
<h2 id="org853d999">Produção de mercadorias por meio de mercadorias: determinação da taxa de lucro e preços relativos em sistemas de capital circulante <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-10-07 qui&gt; </span></span> e <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-10-14 qui&gt;</span></span></h2>
<div class="outline-text-2" id="text-org853d999">
</div>

<div id="outline-container-orgd8ec1c4" class="outline-3">
<h3 id="orgd8ec1c4">Sraffa e o livro</h3>
<div class="outline-text-3" id="text-orgd8ec1c4">
<p>
<b>Projeto:</b> Crítica a abordagem marginalista
</p>
</div>
</div>


<div id="outline-container-org793a893" class="outline-3">
<h3 id="org793a893">Um livro, dois gráficos</h3>
<div class="outline-text-3" id="text-org793a893">
<ol class="org-ol">
<li>Relação inversa entre salário real e taxa de lucro</li>
<li>Relação complexa entre preços relativos e taxa de lucro
<ol class="org-ol">
<li>Na teoria neoclássica, como os preços relativos também dependiam da taxa de lucro, isso gerava inconsistências internas</li>
<li>Dificuldades de mensurar o excedente físico e, assim, calcular a taxa de lucro</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org9c768bd" class="outline-3">
<h3 id="org9c768bd">"Autosuficiência" e viabilidade</h3>
<div class="outline-text-3" id="text-org9c768bd">
</div>
<div id="outline-container-org2808fca" class="outline-4">
<h4 id="org2808fca">Produção de trigo por meio de trigo</h4>
<div class="outline-text-4" id="text-org2808fca">
<ul class="org-ul">
<li>Economia muito simples que produz um único bem (\(X_{1}\)) o utiliza como insumo (capital circulante) (\(A_{11}\))
<ul class="org-ul">
<li>Capital circulante não é sinônimo de consumo intermediário
<ul class="org-ul">
<li>A diferença é que o capital circulante pode ser usado uma única vez enquanto o capital fixo pode ser reutilizado</li>
</ul></li>
</ul></li>
<li>É preciso que exista uma relação técnica (\(a_{11}\)) tecnicamente viável (\(a_{11}<1\)). No entanto, esta condição não é suficiente uma vez que é preciso remunerar o trabalho (\(b_{1}\cdot l\)). Portanto, há uma <b>condição social</b>: \(a_{11}  + b_{1}\cdot l\)</li>
<li>Excedente mede o produto líquido da economia
<ul class="org-ul">
<li>Preços em Sraffa não garantem reposição uma vez quando se considera investimento líquido</li>
<li>Os preços que Sraffa descreve reflete os coeficientes técnicos</li>
<li>É o resíduo dos custos aproximados de repor a produção</li>
</ul></li>
</ul>

<div class="latex" id="org81a3635">
\begin{equation}
A_{11}, L_{1} \to X_{1}
\end{equation}

</div>
<div class="latex" id="org1c61920">
\begin{equation}
a_{11}, l_{1} \to 1
\end{equation}

</div>

<p>
Produzirá excedente se
</p>

<div class="latex" id="org407e610">
\begin{equation}
a_{11} + b_{1}\cdot l_{1} < 1
\end{equation}

</div>
<p>
neste caso, será um excedente em trigo ou em trabalho.
</p>

<p>
Por outro lado, será uma economia de subsistência se
</p>
<div class="latex" id="org99ed2ca">
\begin{equation}
a_{11} + b_{1}\cdot l_{1} = 1
\end{equation}

</div>


<p>
A forma de mensuração do excedente não é o mais relevante, mas sim a representação do sistema econômico.
Dada uma técnica produtiva relevante e uma variável distributiva exógena, é possível indicar a existência do excedente.
O núcleo da teoria do excedente é indicar os elementos em comuns dos autores que partem da noção de excedente.
</p>


<p>
O excedente é uma condição necessária para:
</p>
<ul class="org-ul">
<li>Divisão social do trabalho</li>
<li>Acumulação de capital
<ul class="org-ul">
<li>Excedente permite existência de investimento líquido</li>
<li>Excedente é condição necessária, mas não suficiente</li>
</ul></li>
<li>Estratificação social
<ul class="org-ul">
<li>O que muda entre sistemas econômicos é a regra de divisão do excedente</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2999bdd" class="outline-4">
<h4 id="org2999bdd">Produção a partir de dois insumos e sem excedente</h4>
<div class="outline-text-4" id="text-org2999bdd">
<p>
Sabendo os coeficientes técnicos (necessários), é possível obter os preços relativos sem precisar discutir formato de curvas de oferta e demanda.
Para uma economia de subsistência em que o coeficiente \(a_{ij}\) já inclui salários (coeficiente aumentado):
</p>

<div class="latex" id="orgfa3a34b">
\begin{equation}
\begin{cases}
a_{11}\cdot p_{1} + a_{12}\cdot p_{2} = p_{1}\\
a_{21}\cdot p_{2} + a_{22}\cdot p_{2} = p_{2}
\end{cases}
\end{equation}

</div>


<p>
Supondo que as relações técnicas são dadas, qual o preço relativo?
Por simplificação, é possível supor que um dos preços é unitário:
</p>

<div class="latex" id="orga96fd91">
\begin{equation}
p_{1} = 1
\end{equation}

</div>
<div class="latex" id="orgf1b8b33">
\begin{equation}
\frac{p_{2}}{p_{1}} = \frac{a_{12}}{1-a_{22}} = \frac{a_{21}}{1-a_{11}}
\end{equation}

</div>
<p>
A implicação é que um setor não é independente do outro.
Por exemplo, supondo que o setor 2 remunera os trabalhadores a um salário mais alto.
Para este setor, pode não haver problemas.
No entanto, para o outro setor os custos de obter o produto produzido pelo setor 2 serão maiores.
O preço relativo precisa ser igual ao necessário para garantir a reprodução do sistema.
Os preços relativos são tal que tudo que o setor 2 não utilizou para a sua própria produção tem que ser suficiente para que o outro setor compre.
Dessa forma, é uma teoria objetiva e material das relações de troca.
Um sistema sem excedente não possui grau de liberdade.
</p>


<div class="latex" id="org1b3364c">
\begin{equation}
\frac{p_{2}}{p_{1}} = \frac{\text{Bens setor precisa de outro}}{\text{Excedente fisico deste setor}}
\end{equation}

</div>
<p>
Para dois bens, os preços relativos refletem a interdependência física entre os setores.
Para mais de dois bens, esta relação não é tão direta.
</p>
</div>
</div>
</div>
