notes/iee859---teoria-do-valor-e-precos.org
** Produção com excedente

Se existir excedente, os preços não refletem apenas relações de troca, mas também distribuí-lo.
Nada garante que o excedente físico de um setor ficará contido nele.
Em um sistema econômico em que o excedente é distribuído via preços relativos, não há nenhuma garantia para onde o excedente irá ser deslocado.
Por exemplo, se o preço relativo do segundo setor for muito mais elevado, este setor irá se apropriar mais do excedente uma vez que os custos dos insumos deste segundo setor para o primeiro setor será maior.

Para a discussão da produtividade, é preciso incluir a discussão dos preços relativos.
Se um setor for mais produtivo em termos físicos, pode levar ao erro se a mensuração da produtividade for via valor adicionado/trabalhador.
Isso porque, se o preço relativo do outro setor for mais elevado, o valor adicionado será maior, mas a produtividade em termos físicos do outro setor é maior.

Para que esta economia continue produzindo todos os bens necessários, a taxa de lucro *precisa* ser uniforme.
Caso contrário e não havendo restrições, somente o bem com maiores taxas de lucro será produzido.


Se a soma vertical dos coeficientes for menor que um, a soma horizontal pode ser distinta de setor a setor.
Alguns setores serão superavitários enquanto outros deficitários (em termos físicos).


*** Relação entre excedente e taxa de lucro




** Produção com mais de um bem básico

*** O modelo

#+BEGIN_SRC python :results none
import sympy as sp
from sympy import pprint, latex, Eq, solve, solveset

def mytex(lhs, rhs):
    """
    lhs: left hand side (symbol)
    rhs: right hand side (expression)
    """
    import sympy as sp
    resul = sp.latex(
        sp.Eq(lhs, rhs),
        mode = 'equation*',
        mul_symbol = 'dot',
        # symbol_names = latex_names
    )
    return sp.pprint(resul)

p1, p2 = sp.symbols('p1, p2', positive = True) # Precos
w, v, V, r, R = sp.symbols('w v V r R', nonnegative = True)

a11, a12 = sp.symbols('a_11 a_12')
a21, a22 = sp.symbols('a_21 a_22')
l1, l2 = sp.symbols('l1 l2')
#+END_SRC


Considerando um modelo com dois bens básicos.
Um deles (bem 2, pão) serão utilizado como bem salário e numerário.
Supõe-se também que a cesta de bens dos trabalhadores é composta somente por este bem-salário.

#+BEGIN_SRC python :results html
a21 = a22 = 0
_w = p2*v
mytex(w, _w)
#+END_SRC

#+RESULTS:
#+begin_export html
\begin{equation*}w = p_{2} \cdot v\end{equation*}
#+end_export

Dadas as hipóteses, segue o conjunto de equações:
#+BEGIN_SRC python
_p1 = p1*a11*(1+r) + w*l1
mytex(p1, _p1)
_p2 = p1*a12*(1+r) + w*l2
mytex(p2, _p2)
mytex(w, _w)
mytex(p2, 1)
#+END_SRC

#+RESULTS:
#+begin_export html
\begin{equation*}p_{1} = a_{11} \cdot p_{1} \cdot \left(r + 1\right) + l_{1} \cdot
w\end{equation*}
\begin{equation*}p_{2} = a_{12} \cdot p_{1} \cdot \left(r + 1\right) + l_{2} \cdot
w\end{equation*}
\begin{equation*}w = p_{2} \cdot v\end{equation*}
\begin{equation*}p_{2} = 1\end{equation*}
#+end_export


*** Solução simultânea

Com isso, é possível escrever o preço do bem 1 como:

#+BEGIN_SRC python
tmp_p1 = solve(_p1 - p1, p1)[0].simplify()
mytex(tmp_p1, _p1)
#+END_SRC

#+RESULTS:
#+begin_export html
\begin{equation*}- \frac{l_{1} \cdot w}{a_{11} \cdot r + a_{11} - 1} = a_{11} \cdot
 p_{1} \cdot \left(r + 1\right) + l_{1} \cdot w\end{equation*}
#+end_export

rearrumando:
#+BEGIN_latex
\begin{equation}
p_{1} = \frac{v\cdot l_{1}}{1 - a_{11}\cdot (1 + r)}
\end{equation}
#+END_latex

nesta equação, utiliza-se trabalho direto ($l_{1}$) e indireto ($a_{11}$)[fn:: O coeficiente $a_{11}$ é o custo estritamente necessário para se produzir o bem $1$ mesmo que o salário seja zero.].
Além disso, um /mark-up/ positivo implica uma taxa de lucro positiva (e vice-versa).


Em um caso em que o salário é zero, a taxa de lucro máxima dessa economia é dada por:
#+BEGIN_latex
\begin{equation}
R_{v=0} = \frac{1 - a_{11}}{a_{11}}
\end{equation}
#+END_latex
Este caso deixa evidente que é dada como o produto líquido ($1 - a_{11}$, o que excede a quantidade estritamente necessária) divido pelo estoque de capital.
Também é possível expressar a produtividade do trabalho (valor adicionado/trabalhador) que, ao mesmo tempo, indica a taxa máxima de salário desta economia:
#+BEGIN_latex
\begin{equation}
V = \frac{1 - a_{11}}{l_{1}}
\end{equation}
#+END_latex

Estes casos indicam as possibilidades distributivas de determinada técnica produtiva.
Se a técnica produtiva mudar, pode aumentar tanto a taxa de lucro máxima quanto a produtividade do trabalho.

Continuando a substituição e deixando em função de $v$:
#+BEGIN_latex
\begin{equation}
v = \frac{1}{\frac{l_{1}a_{12}(1+r)}{1 - a_{11}(1+r)} - l_{2}}
\end{equation}
#+END_latex


*** Implicações


No caso em que a taxa de lucro é zero, os preços relativos refletirão os custos diretos e indiretos de produzir tais mercadorias (dada uma técnica produtiva).
Porém, se a taxa de lucro for positiva, os preços relativos *não* serão proporcionais aos uso de trabalho direto e indireto.
Caso sejam proporcionais, *não* será compatível com uma taxa de lucro uniforme.
A teoria do valor-trabalho não considerava a taxa de lucro como relevante para a determinação dos preços relativos.

