docs/notes/iee859---teoria-do-valor-e-precos.html

<div id="outline-container-org88f7dc5" class="outline-3">
<h3 id="org88f7dc5">Produção com excedente</h3>
<div class="outline-text-3" id="text-org88f7dc5">
<p>
Se existir excedente, os preços não refletem apenas relações de troca, mas também distribuí-lo.
Nada garante que o excedente físico de um setor ficará contido nele.
Em um sistema econômico em que o excedente é distribuído via preços relativos, não há nenhuma garantia para onde o excedente irá ser deslocado.
Por exemplo, se o preço relativo do segundo setor for muito mais elevado, este setor irá se apropriar mais do excedente uma vez que os custos dos insumos deste segundo setor para o primeiro setor será maior.
</p>

<p>
Para a discussão da produtividade, é preciso incluir a discussão dos preços relativos.
Se um setor for mais produtivo em termos físicos, pode levar ao erro se a mensuração da produtividade for via valor adicionado/trabalhador.
Isso porque, se o preço relativo do outro setor for mais elevado, o valor adicionado será maior, mas a produtividade em termos físicos do outro setor é maior.
</p>

<p>
Para que esta economia continue produzindo todos os bens necessários, a taxa de lucro <b>precisa</b> ser uniforme.
Caso contrário e não havendo restrições, somente o bem com maiores taxas de lucro será produzido.
</p>


<p>
Se a soma vertical dos coeficientes for menor que um, a soma horizontal pode ser distinta de setor a setor.
Alguns setores serão superavitários enquanto outros deficitários (em termos físicos).
</p>
</div>


<div id="outline-container-orgfa91471" class="outline-4">
<h4 id="orgfa91471">Relação entre excedente e taxa de lucro</h4>
</div>
</div>




<div id="outline-container-org08fc83e" class="outline-3">
<h3 id="org08fc83e">Produção com mais de um bem básico</h3>
<div class="outline-text-3" id="text-org08fc83e">
</div>
<div id="outline-container-org2a5c9db" class="outline-4">
<h4 id="org2a5c9db">O modelo</h4>
<div class="outline-text-4" id="text-org2a5c9db">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ff79c6;">import</span> sympy <span style="color: #ff79c6;">as</span> sp
<span style="color: #ff79c6;">from</span> sympy <span style="color: #ff79c6;">import</span> pprint, latex, Eq, solve, solveset

<span style="color: #ff79c6;">def</span> <span style="color: #50fa7b;">mytex</span>(lhs, rhs):
    <span style="color: #8995ba;">"""</span>
<span style="color: #8995ba;">    lhs: left hand side (symbol)</span>
<span style="color: #8995ba;">    rhs: right hand side (expression)</span>
<span style="color: #8995ba;">    """</span>
    <span style="color: #ff79c6;">import</span> sympy <span style="color: #ff79c6;">as</span> sp
    resul = sp.latex(
        sp.Eq(lhs, rhs),
        mode = <span style="color: #f1fa8c;">'equation*'</span>,
        mul_symbol = <span style="color: #f1fa8c;">'dot'</span>,
        <span style="color: #6272a4;"># </span><span style="color: #6272a4;">symbol_names = latex_names</span>
    )
    <span style="color: #ff79c6;">return</span> sp.pprint(resul)

<span style="color: #ffc9e8;">p1</span>, <span style="color: #ffc9e8;">p2</span> = sp.symbols(<span style="color: #f1fa8c;">'p1, p2'</span>, positive = <span style="color: #8be9fd;">True</span>) <span style="color: #6272a4;"># </span><span style="color: #6272a4;">Precos</span>
<span style="color: #ffc9e8;">w</span>, <span style="color: #ffc9e8;">v</span>, <span style="color: #ffc9e8;">V</span>, <span style="color: #ffc9e8;">r</span>, <span style="color: #ffc9e8;">R</span> = sp.symbols(<span style="color: #f1fa8c;">'w v V r R'</span>, nonnegative = <span style="color: #8be9fd;">True</span>)

<span style="color: #ffc9e8;">a11</span>, <span style="color: #ffc9e8;">a12</span> = sp.symbols(<span style="color: #f1fa8c;">'a_11 a_12'</span>)
<span style="color: #ffc9e8;">a21</span>, <span style="color: #ffc9e8;">a22</span> = sp.symbols(<span style="color: #f1fa8c;">'a_21 a_22'</span>)
<span style="color: #ffc9e8;">l1</span>, <span style="color: #ffc9e8;">l2</span> = sp.symbols(<span style="color: #f1fa8c;">'l1 l2'</span>)
</pre>
</div>


<p>
Considerando um modelo com dois bens básicos.
Um deles (bem 2, pão) serão utilizado como bem salário e numerário.
Supõe-se também que a cesta de bens dos trabalhadores é composta somente por este bem-salário.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffc9e8;">a21</span> = <span style="color: #ffc9e8;">a22</span> = <span style="color: #bd93f9; font-weight: bold;">0</span>
<span style="color: #ffc9e8;">_w</span> = p2*v
mytex(w, _w)
</pre>
</div>

\begin{equation*}w = p_{2} \cdot v\end{equation*}

<p>
Dadas as hipóteses, segue o conjunto de equações:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffc9e8;">_p1</span> = p1*a11*(<span style="color: #bd93f9; font-weight: bold;">1</span>+r) + w*l1
mytex(p1, _p1)
<span style="color: #ffc9e8;">_p2</span> = p1*a12*(<span style="color: #bd93f9; font-weight: bold;">1</span>+r) + w*l2
mytex(p2, _p2)
mytex(w, _w)
mytex(p2, <span style="color: #bd93f9; font-weight: bold;">1</span>)
</pre>
</div>

\begin{equation*}p_{1} = a_{11} \cdot p_{1} \cdot \left(r + 1\right) + l_{1} \cdot
w\end{equation*}
\begin{equation*}p_{2} = a_{12} \cdot p_{1} \cdot \left(r + 1\right) + l_{2} \cdot
w\end{equation*}
\begin{equation*}w = p_{2} \cdot v\end{equation*}
\begin{equation*}p_{2} = 1\end{equation*}
</div>
</div>


<div id="outline-container-orgc232f2d" class="outline-4">
<h4 id="orgc232f2d">Solução simultânea</h4>
<div class="outline-text-4" id="text-orgc232f2d">
<p>
Com isso, é possível escrever o preço do bem 1 como:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #ffc9e8;">tmp_p1</span> = solve(_p1 - p1, p1)[<span style="color: #bd93f9; font-weight: bold;">0</span>].simplify()
mytex(tmp_p1, _p1)
</pre>
</div>

\begin{equation*}- \frac{l_{1} \cdot w}{a_{11} \cdot r + a_{11} - 1} = a_{11} \cdot
 p_{1} \cdot \left(r + 1\right) + l_{1} \cdot w\end{equation*}

<p>
rearrumando:
</p>
<div class="latex" id="orgd55c1f6">
\begin{equation}
p_{1} = \frac{v\cdot l_{1}}{1 - a_{11}\cdot (1 + r)}
\end{equation}

</div>

<p>
nesta equação, utiliza-se trabalho direto (\(l_{1}\)) e indireto (\(a_{11}\))<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
Além disso, um <i>mark-up</i> positivo implica uma taxa de lucro positiva (e vice-versa).
</p>


<p>
Em um caso em que o salário é zero, a taxa de lucro máxima dessa economia é dada por:
</p>
<div class="latex" id="orgb0e1cf0">
\begin{equation}
R_{v=0} = \frac{1 - a_{11}}{a_{11}}
\end{equation}

</div>
<p>
Este caso deixa evidente que é dada como o produto líquido (\(1 - a_{11}\), o que excede a quantidade estritamente necessária) divido pelo estoque de capital.
Também é possível expressar a produtividade do trabalho (valor adicionado/trabalhador) que, ao mesmo tempo, indica a taxa máxima de salário desta economia:
</p>
<div class="latex" id="org57b7714">
\begin{equation}
V = \frac{1 - a_{11}}{l_{1}}
\end{equation}

</div>

<p>
Estes casos indicam as possibilidades distributivas de determinada técnica produtiva.
Se a técnica produtiva mudar, pode aumentar tanto a taxa de lucro máxima quanto a produtividade do trabalho.
</p>

<p>
Continuando a substituição e deixando em função de \(v\):
</p>
<div class="latex" id="orgc2d2c9d">
\begin{equation}
v = \frac{1}{\frac{l_{1}a_{12}(1+r)}{1 - a_{11}(1+r)} - l_{2}}
\end{equation}

</div>
</div>
</div>


<div id="outline-container-orgfdc4fcc" class="outline-4">
<h4 id="orgfdc4fcc">Implicações</h4>
<div class="outline-text-4" id="text-orgfdc4fcc">
<p>
No caso em que a taxa de lucro é zero, os preços relativos refletirão os custos diretos e indiretos de produzir tais mercadorias (dada uma técnica produtiva).
Porém, se a taxa de lucro for positiva, os preços relativos <b>não</b> serão proporcionais aos uso de trabalho direto e indireto.
Caso sejam proporcionais, <b>não</b> será compatível com uma taxa de lucro uniforme.
A teoria do valor-trabalho não considerava a taxa de lucro como relevante para a determinação dos preços relativos.
</p>
</div>
