notes/iee859---teoria-do-valor-e-precos.org
**** Exemplo

Suponha um caso em que um produto (1) utiliza apenas trabalho direto e é finalizado em um período enquanto outro (2) utiliza trabalho direto e indireto e leva dois períodos para se concluir:

#+BEGIN_latex
\begin{equation}
\begin{cases}
p_{1} = l_{1}\cdot w\cdot (1+r)\\
p_{2} = l_{2}\cdot a_{2}\cdot w \cdot (1 + r) + l_{2}\cdot b\cdot w (1 + r)
\end{cases}
\end{equation}
#+END_latex

Para Ricardo, por exemplo, os preços relativos seriam:
#+BEGIN_latex
\begin{equation}
\frac{p_{1}}{p_{2}} = \frac{l_{1}}{l_{2}}
\end{equation}
#+END_latex
O problema é que o produtor do primeiro bem (que leva um período por hipótese) terá uma taxa de lucro sempre maior que o segundo.
A consequência é que a produção mais rápida terá uma taxa de retorno maior e o produto que utiliza trabalho indireto não será economicamente viável.

Para ser compatível com uma taxa de lucro uniforme:
#+BEGIN_latex
\begin{equation}
\begin{cases}
p_{1} = l_{1}\cdot w\cdot (1+r)\\
p_{2} = l_{2}\cdot a_{2}\cdot w \cdot (1 + r)^{2} + l_{2}\cdot b\cdot w (1 + r)
\end{cases}
\end{equation}
#+END_latex
Esse exemplo seria equivalente ao caso em que um dos insumo (trabalho indireto) é comprado de outro setor.
A intuição é que o preço de um dos insumo terá a taxa de lucro do produtor imbutido.
Ou seja, os preços relativos não são *independentes* da taxa de lucro.
Por essa razão, os preços de relativos deixam de ser proporcionais ao uso de trabalho direto e indireto.
Sendo assim, quando a taxa de lucro aumenta, o preço não será alterado igualmente entre os setores.

Para Marx, os preços relativos eram distintos do valor-trabalho[fn::A teoria do valor-trabalho propõe que os preços relativos são proporcionais ao uso de trabalho direto e indireto na produção.].
Como solução, aplicava o procedimento da transformação que iniciava estimando a taxa de lucro geral pela mais-valia e depois seguia-se imputando no cálculo dos preços.
Em resumo, Marx --- nem Ricardo e somente Smith para uma economia em estágio primitivo --- não se baseava na teoria do valor-trabalho.

*** De volta aos preços relativos

Por fim, substituindo a expressão para salário real, obtém-se o preço relativo do primeiro bem:

#+BEGIN_latex
\begin{equation}
p_{1} = \frac{\frac{1}{1 - a_{11}(1+r)}}{\frac{l_{1}a_{12}(1+r)}{1 - a_{11}(1+r)} - l_{2}}
\end{equation}
#+END_latex


Portanto, os preços relativos são não dependem da taxa de lucro se esta for zero:
#+BEGIN_latex
\begin{equation}
V_{r=0} = \frac{1}{l_{2} + \left(\frac{l_{1}}{1 - a_{11}}\right)a_{12}}
\end{equation}
#+END_latex
Por outro lado, só haverá taxa de lucro enquanto existir excedente.

** Preços relativos e distribuição de renda


O preço relativo do bem 1 quando a taxa de lucro é zero ($r=0$) é dado por:
#+BEGIN_latex
\begin{equation}
p_{1} = \frac{\frac{l_{1}}{1 - a_{11}}}{l_{2} + \left(\frac{l_{1}}{1 - a_{11}}\right)a_{12}}
\end{equation}
#+END_latex
Neste caso, temos:
#+BEGIN_latex
\begin{equation}
p_{1} = \frac{\text{Trabalho direta e indiretamente para produzir 1}}{\text{Trabalho direta e indiretamente para produzir 2}}
\end{equation}
#+END_latex

Já quando há uma taxa de lucro positiva,
#+BEGIN_latex
\begin{equation}
p_{1} = \frac{l_{1}}{(l_{1}a_{12} - l_{2}a_{11})(1+r) + l_{2}}
\end{equation}
#+END_latex
O preço relativo irá depender da taxa de lucro se
#+BEGIN_latex
\begin{equation}
l_{1}a_{12} \neq l_{2}a_{11}
\end{equation}
#+END_latex
Analisando cada caso,
#+BEGIN_latex
\begin{equation}
\frac{a_{12}}{l_{2}}
\begin{Bmatrix}
>\\=\\<
\end{Bmatrix}
\frac{a_{11}}{l_{1}}
\end{equation}
#+END_latex

A implicação da mudança do preço relativo

** A relação salário-lucros e os preços relativos

** Discussão de Sraffa (1960) (PCMC)
*** Capítulo 1
*** Capítulo 2

- A taxa máxima de lucro do Sraffa é a mesma que a taxa normal de lucro dos clássicos e de Marx

* A explicação monetária da distribuição
:PROPERTIES:
:ID:       9b80fea3-18f7-4b5f-88b9-7905f61cbff3
:END:

* Concorrência e gravitação


* Renda
:PROPERTIES:
:ID:       237ef9ec-3dfc-4814-946a-9f471f29f4cc
:END:

* Produção conjunta e capital fixo em Sraffa
:PROPERTIES:
:ID:       2d5e92fb-82b2-49f4-aea8-425a9ff157d4
:END:

* Fisiocratas & Smith
:PROPERTIES:
:ID:       2e53f53c-53ec-4a68-8e03-a4b752d3de72
:END:

* Ricardo
:PROPERTIES:
:ID:       00f9ac43-0729-4258-8cb0-1876c2cb50a7
:END:

* Mercadoria padrão
:PROPERTIES:
:ID:       8ea0b1ce-b7fc-4fd7-bd7c-93944168301e
:END:

* Marx depois de Sraffa
:PROPERTIES:
:ID:       a37fd324-12f2-4814-a90b-9093034ffa75
:END:
