docs/notes/iee859---teoria-do-valor-e-precos.html

<div id="outline-container-org675460c" class="outline-5">
<h5 id="org675460c">Exemplo</h5>
<div class="outline-text-5" id="text-org675460c">
<p>
Suponha um caso em que um produto (1) utiliza apenas trabalho direto e é finalizado em um período enquanto outro (2) utiliza trabalho direto e indireto e leva dois períodos para se concluir:
</p>

<div class="latex" id="org967b020">
\begin{equation}
\begin{cases}
p_{1} = l_{1}\cdot w\cdot (1+r)\\
p_{2} = l_{2}\cdot a_{2}\cdot w \cdot (1 + r) + l_{2}\cdot b\cdot w (1 + r)
\end{cases}
\end{equation}

</div>

<p>
Para Ricardo, por exemplo, os preços relativos seriam:
</p>
<div class="latex" id="orgb2a3a21">
\begin{equation}
\frac{p_{1}}{p_{2}} = \frac{l_{1}}{l_{2}}
\end{equation}

</div>
<p>
O problema é que o produtor do primeiro bem (que leva um período por hipótese) terá uma taxa de lucro sempre maior que o segundo.
A consequência é que a produção mais rápida terá uma taxa de retorno maior e o produto que utiliza trabalho indireto não será economicamente viável.
</p>

<p>
Para ser compatível com uma taxa de lucro uniforme:
</p>
<div class="latex" id="orgca76edb">
\begin{equation}
\begin{cases}
p_{1} = l_{1}\cdot w\cdot (1+r)\\
p_{2} = l_{2}\cdot a_{2}\cdot w \cdot (1 + r)^{2} + l_{2}\cdot b\cdot w (1 + r)
\end{cases}
\end{equation}

</div>
<p>
Esse exemplo seria equivalente ao caso em que um dos insumo (trabalho indireto) é comprado de outro setor.
A intuição é que o preço de um dos insumo terá a taxa de lucro do produtor imbutido.
Ou seja, os preços relativos não são <b>independentes</b> da taxa de lucro.
Por essa razão, os preços de relativos deixam de ser proporcionais ao uso de trabalho direto e indireto.
Sendo assim, quando a taxa de lucro aumenta, o preço não será alterado igualmente entre os setores.
</p>

<p>
Para Marx, os preços relativos eram distintos do valor-trabalho<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
Como solução, aplicava o procedimento da transformação que iniciava estimando a taxa de lucro geral pela mais-valia e depois seguia-se imputando no cálculo dos preços.
Em resumo, Marx &#x2014; nem Ricardo e somente Smith para uma economia em estágio primitivo &#x2014; não se baseava na teoria do valor-trabalho.
</p>
</div>
</div>
</div>

<div id="outline-container-org5c488ea" class="outline-4">
<h4 id="org5c488ea">De volta aos preços relativos</h4>
<div class="outline-text-4" id="text-org5c488ea">
<p>
Por fim, substituindo a expressão para salário real, obtém-se o preço relativo do primeiro bem:
</p>

<div class="latex" id="orgb99e921">
\begin{equation}
p_{1} = \frac{\frac{1}{1 - a_{11}(1+r)}}{\frac{l_{1}a_{12}(1+r)}{1 - a_{11}(1+r)} - l_{2}}
\end{equation}

</div>


<p>
Portanto, os preços relativos são não dependem da taxa de lucro se esta for zero:
</p>
<div class="latex" id="orgd4c756f">
\begin{equation}
V_{r=0} = \frac{1}{l_{2} + \left(\frac{l_{1}}{1 - a_{11}}\right)a_{12}}
\end{equation}

</div>
<p>
Por outro lado, só haverá taxa de lucro enquanto existir excedente.
</p>
</div>
</div>
</div>

<div id="outline-container-org398f6f7" class="outline-3">
<h3 id="org398f6f7">Preços relativos e distribuição de renda</h3>
<div class="outline-text-3" id="text-org398f6f7">
<p>
O preço relativo do bem 1 quando a taxa de lucro é zero (\(r=0\)) é dado por:
</p>
<div class="latex" id="orgffb3b47">
\begin{equation}
p_{1} = \frac{\frac{l_{1}}{1 - a_{11}}}{l_{2} + \left(\frac{l_{1}}{1 - a_{11}}\right)a_{12}}
\end{equation}

</div>
<p>
Neste caso, temos:
</p>
<div class="latex" id="org087e0ab">
\begin{equation}
p_{1} = \frac{\text{Trabalho direta e indiretamente para produzir 1}}{\text{Trabalho direta e indiretamente para produzir 2}}
\end{equation}

</div>

<p>
Já quando há uma taxa de lucro positiva,
</p>
<div class="latex" id="org510aa63">
\begin{equation}
p_{1} = \frac{l_{1}}{(l_{1}a_{12} - l_{2}a_{11})(1+r) + l_{2}}
\end{equation}

</div>
<p>
O preço relativo irá depender da taxa de lucro se
</p>
<div class="latex" id="org09ad2b4">
\begin{equation}
l_{1}a_{12} \neq l_{2}a_{11}
\end{equation}

</div>
<p>
Analisando cada caso,
</p>
<div class="latex" id="org6883de8">
\begin{equation}
\frac{a_{12}}{l_{2}}
\begin{Bmatrix}
>\\=\\<
\end{Bmatrix}
\frac{a_{11}}{l_{1}}
\end{equation}

</div>

<p>
A implicação da mudança do preço relativo
</p>
</div>
</div>

<div id="outline-container-org8b8c320" class="outline-3">
<h3 id="org8b8c320">A relação salário-lucros e os preços relativos</h3>
</div>

<div id="outline-container-orgf0bcaf8" class="outline-3">
<h3 id="orgf0bcaf8">Discussão de Sraffa (1960) (PCMC)</h3>
<div class="outline-text-3" id="text-orgf0bcaf8">
</div>
<div id="outline-container-org2c3178c" class="outline-4">
<h4 id="org2c3178c">Capítulo 1</h4>
</div>
<div id="outline-container-orgbbeae17" class="outline-4">
<h4 id="orgbbeae17">Capítulo 2</h4>
<div class="outline-text-4" id="text-orgbbeae17">
<ul class="org-ul">
<li>A taxa máxima de lucro do Sraffa é a mesma que a taxa normal de lucro dos clássicos e de Marx</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org99ab90b" class="outline-2">
<h2 id="org99ab90b">A explicação monetária da distribuição</h2>
<div class="outline-text-2" id="text-org99ab90b">
</div>
</div>

<div id="outline-container-orgc5b1e02" class="outline-2">
<h2 id="orgc5b1e02">Concorrência e gravitação</h2>
</div>


<div id="outline-container-orgb8c3c20" class="outline-2">
<h2 id="orgb8c3c20">Renda</h2>
<div class="outline-text-2" id="text-orgb8c3c20">
</div>
</div>

<div id="outline-container-orgc7d4eb1" class="outline-2">
<h2 id="orgc7d4eb1">Produção conjunta e capital fixo em Sraffa</h2>
<div class="outline-text-2" id="text-orgc7d4eb1">
</div>
</div>

<div id="outline-container-org2675f95" class="outline-2">
<h2 id="org2675f95">Fisiocratas &amp; Smith</h2>
<div class="outline-text-2" id="text-org2675f95">
</div>
</div>

<div id="outline-container-org7b5e5b0" class="outline-2">
<h2 id="org7b5e5b0">Ricardo</h2>
<div class="outline-text-2" id="text-org7b5e5b0">
</div>
</div>

<div id="outline-container-org703cfa4" class="outline-2">
<h2 id="org703cfa4">Mercadoria padrão</h2>
<div class="outline-text-2" id="text-org703cfa4">
</div>
</div>

<div id="outline-container-orgf248829" class="outline-2">
<h2 id="orgf248829">Marx depois de Sraffa</h2>
<div class="outline-text-2" id="text-orgf248829">
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">O coeficiente \(a_{11}\) é o custo estritamente necessário para se produzir o bem \(1\) mesmo que o salário seja zero.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">A teoria do valor-trabalho propõe que os preços relativos são proporcionais ao uso de trabalho direto e indireto na produção.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2º Semestre de 2021</p>
<p class="author">Author: Gabriel Petrini</p>
<p class="date">Created: 2021-10-28 qui 14:53</p>
</div>
</body>
</html>
